## Staging: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  NAME                                   |
|--------|-------------------------------------------------------------------------|
| update | `module.rds_cluster.aws_rds_cluster.cluster`                            |
|        | `module.rds_cluster.aws_rds_cluster_instance.instances[0]`              |
|        | `module.rds_cluster.aws_security_group.rds_proxy`                       |
| add    | `module.rds_cluster.aws_cloudwatch_log_group.log_exports[&quot;postgresql&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.rds_cluster.aws_cloudwatch_log_group.log_exports["postgresql"] will be created
  + resource "aws_cloudwatch_log_group" "log_exports" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/rds/cluster/saas-procurement-database-cluster/postgresql"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "saas-procurement"
          + "Name"       = "saas-procurement-database-cluster"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "saas-procurement"
          + "Name"       = "saas-procurement-database-cluster"
          + "Terraform"  = "true"
        }
    }

  # module.rds_cluster.aws_rds_cluster.cluster will be updated in-place
  ~ resource "aws_rds_cluster" "cluster" {
      ~ copy_tags_to_snapshot               = false -> true
      ~ enabled_cloudwatch_logs_exports     = [
          + "postgresql",
        ]
      ~ engine_version                      = "14.9" -> "14.6"
        id                                  = "saas-procurement-database-cluster"
      ~ preferred_maintenance_window        = "thu:04:25-thu:04:55" -> "sun:06:00-sun:07:00"
        tags                                = {
            "CostCentre" = "saas-procurement"
            "Name"       = "saas-procurement-database-cluster"
            "Terraform"  = "true"
        }
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rds_cluster.aws_rds_cluster_instance.instances[0] will be updated in-place
  ~ resource "aws_rds_cluster_instance" "instances" {
      ~ engine_version                        = "14.9" -> "14.6"
        id                                    = "saas-procurement-database-instance-0"
        tags                                  = {
            "CostCentre" = "saas-procurement"
            "Name"       = "saas-procurement-database-instance-0"
            "Terraform"  = "true"
        }
        # (28 unchanged attributes hidden)
    }

  # module.rds_cluster.aws_security_group.rds_proxy will be updated in-place
  ~ resource "aws_security_group" "rds_proxy" {
        id                     = "sg-051638cd60aef88c3"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 5432
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow RDS cluster to receive requests from ECS"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0d1ca7e7e561a219f",
                ]
              - self             = false
              - to_port          = 5432
            },
          + {
              + cidr_blocks      = []
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 5432
            },
        ]
        name                   = "saas-procurement-database_rds_proxy_sg"
        tags                   = {
            "CostCentre" = "saas-procurement"
            "Name"       = "saas-procurement-database_rds_proxy_sg"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
